import React, { Component } from 'react';

//--------------------------------------------------------------------------------------------------------
//Appというクラスがコンポーネントを継承して存在している。
//このAppのことをクラスコンポーネントと言う
//----------------------------------------------
// class App extends Component {
//   render() {
//     return (
//       <React.Fragment>
//         <label htmlFor="bar">bare</label>
//         <input type="text" onChange={() => { console.log('TEST') }} />;
//       </React.Fragment>
//     )

//   }
// }
//--------------------------------------------------------------------------------------------------------

//----------------------------------------------------------------------------------------------------------------------------------
//ファンクショナルコンポーネント。関数コンポーネントは以下の通り
const App = () => {
  return (
    <div>
      <Cat />
      <Cat />
      <Cat />
    </div>
  )
}

const Cat = () => {
  return <div>Meow!</div>
}

export default App;
